OdDAI.AttributeKey.op_LessThan(OdAnsiString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Compares this attribute key with the specified attribute key by names.
\param keyName      [in] Key name of other attribute key to compare with.
\returns true if this attribute key has starting character with a lesser ASCII value than the corresponding character in other attribute key;
otherwise the method returns false.

OdDAI.AttributeKey.op_LessThan(OdDAI.AttributeKey!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Compares this attribute key with the specified attribute key by names.
\param other       [in] Other attribute key to compare with.
\returns true if this attribute key has starting character with a lesser ASCII value than the corresponding character in other attribute key;
otherwise the method returns false.

OdDAI.AttributeKey.dataLogic
Associated attribute data logic.

OdDAI.AttributeKey.isComplex
Indicates whether the attribute is complex.

OdDAI.AttributeKey.isDerived
Indicates whether the attribute is derived.

OdDAI.AttributeKey.attribute
Associated attribute.

OdDAI.AttributeKey.typeSize
Type size of an attribute key.

OdDAI.AttributeKey.typeOffset
Type offset of an attribute key.

OdDAI.AttributeKey.declareOrderIndex
Index of an attribute key.

OdDAI.AttributeKey
\details
This structure contains data related to an attribute key that is a part of an attribute key collection.